; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v6 ?v12)
             (pred_4 ?v8 ?v11)
             (pred_8 ?v6 ?v11)
             (pred_5 ?v13 ?v6 )
	     (pred_2 ?v6)
             (pred_10 ?v1)
             (pred_1 ?v8)
             (pred_12 ?v11)
             (pred_11 ?v6)
             (pred_9 ?v8)
             (pred_3 ?v6)
             (pred_7 ))



(:action op_3
:parameters (?v10 ?v5 ?v7 ?v3)
:precondition (and (pred_10 ?v10) (pred_10 ?v5) (pred_1 ?v7) (pred_12 ?v3)
          (pred_6 ?v10 ?v5) (pred_4 ?v7 ?v3)
                   (pred_8 ?v5 ?v3) (pred_2 ?v10) 
                   (pred_11 ?v5) (pred_9 ?v7))
:effect (and  (pred_3 ?v5) (not (pred_11 ?v5))))


(:action op_5
:parameters (?v10 ?v4)
:precondition (and (pred_10 ?v10) (pred_10 ?v4)
               (pred_2 ?v10) (pred_6 ?v10 ?v4) (pred_3 ?v4))
:effect (and (pred_2 ?v4) (not (pred_2 ?v10))))

(:action op_2
:parameters (?v10 ?v7)
:precondition (and (pred_10 ?v10) (pred_1 ?v7) 
                  (pred_2 ?v10) (pred_5 ?v7 ?v10) (pred_7 ))
:effect (and (pred_9 ?v7)
   (not (pred_5 ?v7 ?v10)) (not (pred_7 ))))


(:action op_4
:parameters (?v10 ?v9 ?v2)
:precondition (and (pred_10 ?v10) (pred_1 ?v9) (pred_1 ?v2)
                  (pred_2 ?v10) (pred_9 ?v2) (pred_5 ?v9 ?v10))
:effect (and (pred_9 ?v9) (pred_5 ?v2 ?v10)
        (not (pred_9 ?v2)) (not (pred_5 ?v9 ?v10))))

(:action op_1
:parameters (?v10 ?v7)
:precondition (and (pred_10 ?v10) (pred_1 ?v7) 
                  (pred_2 ?v10) (pred_9 ?v7))
:effect (and (pred_7 ) (pred_5 ?v7 ?v10) (not (pred_9 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_16 obj_14 obj_02 obj_15 obj_19 obj_03 obj_10 obj_05 obj_01 obj_09 obj_20 obj_11 obj_12 obj_07 obj_13
    obj_17 obj_18
    obj_08 obj_04
    )

    (:init
       (pred_7)

       (pred_10 obj_06)
       (pred_10 obj_16)
       (pred_10 obj_14)
       (pred_10 obj_02)
       (pred_10 obj_15)
       (pred_10 obj_19)
       (pred_10 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_05)
       (pred_10 obj_01)
       (pred_10 obj_09)
       (pred_10 obj_20)
       (pred_10 obj_11)
       (pred_10 obj_12)
       (pred_10 obj_07)
       (pred_10 obj_13)
       (pred_12 obj_17)
       (pred_12 obj_18)
       (pred_1 obj_08)
       (pred_1 obj_04)

       (pred_6 obj_06 obj_15)
       (pred_6 obj_06 obj_16)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_16 obj_14)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_14 obj_03)
       (pred_6 obj_14 obj_02)
       (pred_6 obj_14 obj_16)
       (pred_6 obj_02 obj_10)
       (pred_6 obj_02 obj_14)
       (pred_6 obj_15 obj_05)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_19 obj_01)
       (pred_6 obj_19 obj_03)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_03 obj_09)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_03 obj_14)
       (pred_6 obj_03 obj_19)
       (pred_6 obj_10 obj_20)
       (pred_6 obj_10 obj_02)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_05 obj_11)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_05 obj_15)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_01 obj_19)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_09 obj_20)
       (pred_6 obj_09 obj_03)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_10)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_11 obj_12)
       (pred_6 obj_11 obj_05)
       (pred_6 obj_12 obj_07)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_12 obj_11)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_07 obj_12)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_13 obj_07)
       (pred_11 obj_01)
       (pred_11 obj_13)
       (pred_8  obj_01 obj_17)
       (pred_8  obj_13 obj_18)
       (pred_3 obj_06)
       (pred_3 obj_16)
       (pred_3 obj_14)
       (pred_3 obj_02)
       (pred_3 obj_15)
       (pred_3 obj_19)
       (pred_3 obj_03)
       (pred_3 obj_10)
       (pred_3 obj_05)
       (pred_3 obj_09)
       (pred_3 obj_20)
       (pred_3 obj_11)
       (pred_3 obj_12)
       (pred_3 obj_07)

       (pred_4  obj_08 obj_17)
       (pred_4  obj_04 obj_18)
       (pred_5 obj_08 obj_16)
       (pred_5 obj_04 obj_20)
       (pred_2 obj_12)
    )

    (:goal (and
       (pred_5 obj_08 obj_06)
       (pred_5 obj_04 obj_14)
    ))
(:constraints
  (always (not (pred_2 obj_09)))
)
)

; plan
1. (op_5 obj_12 obj_11)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_11)
   goals met: 0 of 2
2. (op_5 obj_11 obj_05)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_05)
   goals met: 0 of 2
3. (op_5 obj_05 obj_15)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_15)
   goals met: 0 of 2
4. (op_5 obj_15 obj_06)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_06)
   goals met: 0 of 2
5. (op_5 obj_06 obj_16)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_16)
   goals met: 0 of 2
6. (op_2 obj_16 obj_08)
   deleted: (pred_5 obj_08 obj_16) (pred_7)
   added: (pred_9 obj_08)
   goals met: 0 of 2
7. (op_5 obj_16 obj_06)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_06)
   goals met: 0 of 2
8. (op_1 obj_06 obj_08)
   deleted: (pred_9 obj_08)
   added: (pred_7) (pred_5 obj_08 obj_06)
   goals met: 1 of 2
9. (op_5 obj_06 obj_16)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_16)
   goals met: 1 of 2
10. (op_5 obj_16 obj_14)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_14)
   goals met: 1 of 2
11. (op_5 obj_14 obj_02)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_02)
   goals met: 1 of 2
12. (op_5 obj_02 obj_10)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_10)
   goals met: 1 of 2
13. (op_5 obj_10 obj_20)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_20)
   goals met: 1 of 2
14. (op_2 obj_20 obj_04)
   deleted: (pred_5 obj_04 obj_20) (pred_7)
   added: (pred_9 obj_04)
   goals met: 1 of 2
15. (op_5 obj_20 obj_10)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_10)
   goals met: 1 of 2
16. (op_5 obj_10 obj_02)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_02)
   goals met: 1 of 2
17. (op_5 obj_02 obj_14)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_14)
   goals met: 1 of 2
18. (op_1 obj_14 obj_04)
   deleted: (pred_9 obj_04)
   added: (pred_7) (pred_5 obj_04 obj_14)
   goals met: 2 of 2
